//*************************************************************************//
//* Name				:   sdi0819.c
//* Vision				:	VC
//* Project				:   SDI0819系列方案
//* Function			:   SDI0819 接口函数
//* $Author				:   superc
//*
//* Copyright 2012 by solidic
//*
//* Recode:
//*						1: 2013-01-10  First Creat By Superc
//*
//*
//*
//*************************************************************************//
#include <REG52.H>
#include <math.h>
//**************************************************************************
// -- 全部头文件 集中管理 ---- ，版本修改文件名会变动 ---  必须修改 这个文件
//**************************************************************************
#include "./_solidic/head_file_version.h"

//****************************************************
//-------------其他模块全局变量----------------------
//----全局变量 ADCcmd : 		//(头文件)ext_data
//----IO定义 : 					//(头文件)ext_data
//****************************************************

void sclk_unit(void)
{
	_nop_();
	SCLK = 1;
	_nop_();
	SCLK = 0;
}

//-------------------------- 
void data_receive(void)
{
	char	i;
	//--ADcode_pre--赋值0
	ADcode_pre = 0;
	//--读取 24位 ADC 的输出
	for(i=0;i<24;i++)
	{	
		ADcode_pre <<=1;
		sclk_unit();
		if(DRDY_SDO)
		ADcode_pre++;
	}
	//--因为输出为双极性，+0x800000将负端平移上来
	ADcode_pre ^= 0x800000;	
	
	//--SDI0819的配置脉冲--通道A,PGA=128
	sclk_unit(); //-- 25
	sclk_unit(); //-- 26
	sclk_unit(); //-- 27
	
	//--SDI0819 控制休眠
	if(ADCcmd == 1)
	{
		_nop_();
		SCLK = 1;
		ADCcmd = 0;
	}
}
